/***************************************************************************/
/*                                                                         */
/*  Copyright 2018-2022 by                                                 */
/*  Vily(vily313@126.com)                                                  */
/*                                                                         */
/***************************************************************************/

/**
 * 整个cospace的外壳
 */
class CoShell {

    constructor() {
    }
    initialize(): void {
    }
    destroy(): void {
    }
}

export { CoShell };
