/***************************************************************************/
/*                                                                         */
/*  Copyright 2018-2023 by                                                 */
/*  Vily(vily313@126.com)                                                  */
/*                                                                         */
/***************************************************************************/

/**
 * (引擎)数据/资源协同空间系统模块
 */
class CoSystem {

    constructor() {
    }
    /**
     */
    initialize(): void {
    }
    destroy(): void {
    }
}

export { CoSystem };
